AUTO_config_TK_pesok/src/Documents/ТК_ПравилаСписанияДопМатериалов/ТК_ПравилаСписанияДопМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТК_ПравилаСписанияДопМатериалов</name>
  <comment>Правила списания дополнительных материалов при продаже товаров</comment>
  <registerRecords>InformationRegister.ТК_ПравилаСписанияДопМатериалов</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <comment>Единица измерения номенклатурной позиции</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество продукции, которое может быть выпущено с указанными ингредиентами</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяСписанияТМЦ</name>
    <comment>Статья списания ТМЦ на расходы</comment>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДопМатериалы</name>
    <comment>Таблица товаров и услуг</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар, услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>Единица измерения номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество списания</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Documents/ТК_ПравилаСписанияДопМатериалов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс	

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Документ.ПоступлениеТоваров";
	//КомандаПечати.Идентификатор = "АктНедопоставки";
	//КомандаПечати.Представление = НСтр("ru = 'Акт недопоставки';uk='Акт недопостачання'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 		
	//МассивУсловий = Новый Массив;
	//МассивУсловий.Добавить(Новый Структура("Реквизит, Значение, ВидСравнения", "ИспользоватьЦеныИзПротоколов", Истина, ВидСравнения.Равно));	
	////МассивУсловий.Добавить(Новый Структура("Реквизит, Значение, ВидСравнения", "ЕстьРасхождения", Истина, ВидСравнения.Равно));	
	//КомандаПечати.УсловияВидимости = МассивУсловий;
	
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	КомандаОтчет = ВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	Если КомандаОтчет <> Неопределено Тогда
		КомандаОтчет.МестоРазмещения = "ПодменюОтчеты";
	КонецЕсли;
	
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ПодразделениеКомпании)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом


#КонецОбласти	


#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт

	// Создание запроса инициализации движений и заполенение его параметров.
	Запрос = Новый Запрос;		
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДополнительныеСвойства);
	            	
	// Формирование текста запроса.
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаТК_ПравилаСписанияДопМатериалов(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДополнительныеСвойства)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТК_ПравилаСписанияДопМатериалов.Дата КАК Период,
	|	ТК_ПравилаСписанияДопМатериалов.ХозОперация КАК ХозОперация,
	|	ТК_ПравилаСписанияДопМатериалов.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ТК_ПравилаСписанияДопМатериалов.Номенклатура КАК Номенклатура,
	|	ТК_ПравилаСписанияДопМатериалов.ЕдиницаИзмерения.Коэффициент КАК Коэффициент,
	|	ТК_ПравилаСписанияДопМатериалов.Количество * ЕСТЬNULL(ТК_ПравилаСписанияДопМатериалов.ЕдиницаИзмерения.Коэффициент, 1) КАК КоличествоБазовое,
	|	ТК_ПравилаСписанияДопМатериалов.СтатьяСписанияТМЦ КАК СтатьяСписания
	|ИЗ
	|	Документ.ТК_ПравилаСписанияДопМатериалов КАК ТК_ПравилаСписанияДопМатериалов
	|ГДЕ
	|	ТК_ПравилаСписанияДопМатериалов.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Ссылка",                                   ДокументСсылка);
	Запрос.УстановитьПараметр("Период",                                   Реквизиты.Период);
	Запрос.УстановитьПараметр("ПодразделениеКомпании",                    Реквизиты.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ХозОперация",							  Реквизиты.ХозОперация);
	Запрос.УстановитьПараметр("Номенклатура", 							  Реквизиты.Номенклатура);
	Запрос.УстановитьПараметр("КоличествоБазовое",						  Реквизиты.КоличествоБазовое);
	Запрос.УстановитьПараметр("СтатьяСписания", 						  Реквизиты.СтатьяСписания);
		
	ДополнительныеСвойства.ДляПроведения.Вставить("ПодразделениеКомпании", Реквизиты.ПодразделениеКомпании);
	ДополнительныеСвойства.ДляПроведения.Вставить("ХозОперация",Реквизиты.ХозОперация);

КонецПроцедуры
	
Функция ТекстЗапросаВтТаблицы(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтТаблицаДопМатериалы";
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТК_ПравилаСписанияДопМатериаловДопМатериалы.Номенклатура КАК ДопМатериал,
	               |	ТК_ПравилаСписанияДопМатериаловДопМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ТК_ПравилаСписанияДопМатериаловДопМатериалы.Коэффициент КАК Коэффициент,
	               |	ТК_ПравилаСписанияДопМатериаловДопМатериалы.Количество КАК Количество
	               |ПОМЕСТИТЬ ВтТаблицаДопМатериалы
	               |ИЗ
	               |	Документ.ТК_ПравилаСписанияДопМатериалов.ДопМатериалы КАК ТК_ПравилаСписанияДопМатериаловДопМатериалы
	               |ГДЕ
	               |	ТК_ПравилаСписанияДопМатериаловДопМатериалы.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
		                  
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаТК_ПравилаСписанияДопМатериалов(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТК_ПравилаСписанияДопМатериалов";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтТаблицаДопМатериалы", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицы(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	&Период КАК Период,
	               |	&Номенклатура КАК Номенклатура,
	               |	ВтТаблицаДопМатериалы.ДопМатериал КАК ДопМатериал,
	               |	ВтТаблицаДопМатериалы.Количество * ВтТаблицаДопМатериалы.Коэффициент / &КоличествоБазовое КАК Количество,
	               |	ВЫБОР
	               |		КОГДА &ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтменаПравилаСписанияДопМатериалов)
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК Статус,
	               |	&СтатьяСписания КАК СтатьяСписания
	               |ИЗ
	               |	ВтТаблицаДопМатериалы КАК ВтТаблицаДопМатериалы"; 
		
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции


#КонецОбласти



#Иначе
	
#КонецЕсли
